Revit 2024 API
ImageTypeOptions.Path Property
 The path of the file that specifies the image to be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public string Path { get; }
Visual Basic
Public ReadOnly Property Path As String
	Get
Visual C++
public:
property String^ Path {
	String^ get ();
}
See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace